RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_lcd.h
#define    LCD_ISR_DONIF_Pos                                      (1U)
#define    LCD_ISR_DONIF_Msk                                      (0x1U << LCD_ISR_DONIF_Pos)
#define    LCD_ISR_DONIF                                          LCD_ISR_DONIF_Msk

#define    LCD_ISR_DOFFIF_Pos                                     (0U)
#define    LCD_ISR_DOFFIF_Msk                                     (0x1U << LCD_ISR_DOFFIF_Pos)
#define    LCD_ISR_DOFFIF                                         LCD_ISR_DOFFIF_Msk

#define    LCD_DATA0_DSDA_Pos                                     (0U)
#define    LCD_DATA0_DSDA_Msk                                     (0xffffffffU << LCD_DATA0_DSDA_Pos)
#define    LCD_DATA0_DSDA                                         LCD_DATA0_DSDA_Msk



#define    FL_LCD_DATA_REG0                                       (0x0U << 0U)
#define    FL_LCD_DATA_REG1                                       (0x1U << 0U)
#define    FL_LCD_DATA_REG2                                       (0x2U << 0U)
#define    FL_LCD_DATA_REG3                                       (0x3U << 0U)
#define    FL_LCD_DATA_REG4                                       (0x4U << 0U)
#define    FL_LCD_DATA_REG5                                       (0x5U << 0U)
#define    FL_LCD_DATA_REG6                                       (0x6U << 0U)
#define    FL_LCD_DATA_REG7                                       (0x7U << 0U)
#define    FL_LCD_DATA_REG8                                       (0x8U << 0U)
#define    FL_LCD_DATA_REG9                                       (0x9U << 0U)
#define    FL_LCD_COMEN_COM0                                      (0x1U << 0U)
#define    FL_LCD_COMEN_COM1                                      (0x1U << 1U)
#define    FL_LCD_COMEN_COM2                                      (0x1U << 2U)
#define    FL_LCD_COMEN_COM3                                      (0x1U << 3U)
#define    FL_LCD_COMEN_COM4                                      (0x1U << 28U)
#define    FL_LCD_COMEN_COM5                                      (0x1U << 29U)
#define    FL_LCD_COMEN_COM6                                      (0x1U << 30U)
#define    FL_LCD_COMEN_COM7                                      (0x1U << 31U)
#define    FL_LCD_SEGEN0_SEG0                                     (0x1U << 0U)
#define    FL_LCD_SEGEN0_SEG1                                     (0x1U << 1U)
#define    FL_LCD_SEGEN0_SEG2                                     (0x1U << 2U)
#define    FL_LCD_SEGEN0_SEG3                                     (0x1U << 3U)
#define    FL_LCD_SEGEN0_SEG4                                     (0x1U << 4U)
#define    FL_LCD_SEGEN0_SEG5                                     (0x1U << 5U)
#define    FL_LCD_SEGEN0_SEG6                                     (0x1U << 6U)
#define    FL_LCD_SEGEN0_SEG7                                     (0x1U << 7U)
#define    FL_LCD_SEGEN0_SEG8                                     (0x1U << 8U)
#define    FL_LCD_SEGEN0_SEG9                                     (0x1U << 9U)
#define    FL_LCD_SEGEN0_SEG10                                    (0x1U << 10U)
#define    FL_LCD_SEGEN0_SEG11                                    (0x1U << 11U)
#define    FL_LCD_SEGEN0_SEG12                                    (0x1U << 12U)
#define    FL_LCD_SEGEN0_SEG13                                    (0x1U << 13U)
#define    FL_LCD_SEGEN0_SEG14                                    (0x1U << 14U)
#define    FL_LCD_SEGEN0_SEG15                                    (0x1U << 15U)
#define    FL_LCD_SEGEN0_SEG16                                    (0x1U << 16U)
#define    FL_LCD_SEGEN0_SEG17                                    (0x1U << 17U)
#define    FL_LCD_SEGEN0_SEG18                                    (0x1U << 18U)
#define    FL_LCD_SEGEN0_SEG19                                    (0x1U << 19U)
#define    FL_LCD_SEGEN0_SEG20                                    (0x1U << 20U)
#define    FL_LCD_SEGEN0_SEG21                                    (0x1U << 21U)
#define    FL_LCD_SEGEN0_SEG22                                    (0x1U << 22U)
#define    FL_LCD_SEGEN0_SEG23                                    (0x1U << 23U)
#define    FL_LCD_SEGEN0_SEG24                                    (0x1U << 24U)
#define    FL_LCD_SEGEN0_SEG25                                    (0x1U << 25U)
#define    FL_LCD_SEGEN0_SEG26                                    (0x1U << 26U)
#define    FL_LCD_SEGEN0_SEG27                                    (0x1U << 27U)
#define    FL_LCD_SEGEN0_SEG28                                    (0x1U << 28U)
#define    FL_LCD_SEGEN0_SEG29                                    (0x1U << 29U)
#define    FL_LCD_SEGEN0_SEG30                                    (0x1U << 30U)
#define    FL_LCD_SEGEN0_SEG31                                    (0x1U << 31U)
#define    FL_LCD_SEGEN1_SEG0                                     (0x1U << 0U)
#define    FL_LCD_SEGEN1_SEG1                                     (0x1U << 1U)
#define    FL_LCD_SEGEN1_SEG2                                     (0x1U << 2U)
#define    FL_LCD_SEGEN1_SEG3                                     (0x1U << 3U)
#define    FL_LCD_SEGEN1_SEG4                                     (0x1U << 4U)
#define    FL_LCD_SEGEN1_SEG5                                     (0x1U << 5U)
#define    FL_LCD_SEGEN1_SEG6                                     (0x1U << 6U)
#define    FL_LCD_SEGEN1_SEG7                                     (0x1U << 7U)
#define    FL_LCD_SEGEN1_SEG8                                     (0x1U << 8U)
#define    FL_LCD_SEGEN1_SEG9                                     (0x1U << 9U)
#define    FL_LCD_SEGEN1_SEG10                                    (0x1U << 10U)
#define    FL_LCD_SEGEN1_SEG11                                    (0x1U << 11U)



#define    FL_LCD_CAP_DRIVER_FREQ_FRAME_COM                       (0x0U << LCD_CR_SCFSEL_Pos)
#define    FL_LCD_CAP_DRIVER_FREQ_LSCLK_DIV8                      (0x1U << LCD_CR_SCFSEL_Pos)
#define    FL_LCD_CAP_DRIVER_FREQ_LSCLK_DIV16                     (0x2U << LCD_CR_SCFSEL_Pos)
#define    FL_LCD_CAP_DRIVER_FREQ_LSCLK_DIV32                     (0x3U << LCD_CR_SCFSEL_Pos)
#define    FL_LCD_CAP_DRIVER_FREQ_LSCLK_DIV64                     (0x4U << LCD_CR_SCFSEL_Pos)
#define    FL_LCD_CAP_DRIVER_FREQ_LSCLK_DIV128                    (0x5U << LCD_CR_SCFSEL_Pos)
#define    FL_LCD_CAP_DRIVER_FREQ_LSCLK_DIV256                    (0x6U << LCD_CR_SCFSEL_Pos)
#define    FL_LCD_CAP_DRIVER_FREQ_LSCLK_DIV512                    (0x7U << LCD_CR_SCFSEL_Pos)


#define    FL_LCD_CAP_DRIVER_MODE_ONE                             (0x0U << LCD_CR_SC_CTRL_Pos)
#define    FL_LCD_CAP_DRIVER_MODE_TWO                             (0x1U << LCD_CR_SC_CTRL_Pos)
#define    FL_LCD_CAP_DRIVER_MODE_FOUR                            (0x2U << LCD_CR_SC_CTRL_Pos)
#define    FL_LCD_CAP_DRIVER_MODE_MANY                            (0x3U << LCD_CR_SC_CTRL_Pos)


#define    FL_LCD_BIAS_CURRENT_VERYHIGH                           (0x0U << LCD_CR_IC_CTRL_Pos)
#define    FL_LCD_BIAS_CURRENT_HIGH                               (0x1U << LCD_CR_IC_CTRL_Pos)
#define    FL_LCD_BIAS_CURRENT_MEDIUM                             (0x2U << LCD_CR_IC_CTRL_Pos)
#define    FL_LCD_BIAS_CURRENT_LOW                                (0x3U << LCD_CR_IC_CTRL_Pos)


